Autodesk.Revit.DB.ImageType.IsLoadedFromFile
Checks whether the image is loaded from a file.
Revit may generate some images internally, such as the images created by "Save to Project as Image".
Returns:
True if the image is loaded from a file, False otherwise.
Since:
2015

Autodesk.Revit.DB.ImageType.ReloadFrom(System.String)
Reloads the image from new image file.
Remarks:
If reload fails (because the image file doesn't exist or cannot be read),
the currently loaded image will remain unchanged.
Please note that only images with non-empty path could be reloaded.
imagePath:
A new path to an image file to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
imagePath is an empty string.
-or-
The given imagePath is not a valid image file to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given imagePath does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This image is not loaded from a file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Since:
2015

Autodesk.Revit.DB.ImageType.Reload
Reloads the image from its origin file.
Remarks:
If reload fails (because the image file doesn't exist or cannot be read),
the currently loaded image will remain unchanged.
Please note that only images with non-empty path could be reloaded.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The associated image file of the ImageType doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This image is not loaded from a file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Since:
2015

Autodesk.Revit.DB.ImageType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new ImageType element and loads the image into it.
Remarks:
The ImageType will be created but will not be placed into any view.
document:
The document.
imagePath:
A path to an image file to load.
Returns:
The new ImageType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
imagePath is an empty string.
-or-
The given imagePath is not a valid image file to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given imagePath does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015

Autodesk.Revit.DB.ImageType.Path
The original image file path used if the image is loaded from a disk file, or empty if the image
is generated by Revit internally, such as the images created by "Save to Project as Image".
Remarks:
This path will be used when Reload() is called, and also be checked when ReloadFrom() is called.
Since:
2015

Autodesk.Revit.DB.ImageType.GetImage
Get the bitmap image stored in the image symbol.
Returns: The bitmap image at the original loaded image size.
Since: 2015

Autodesk.Revit.DB.ImageType
Represents a type containing an image. Instances of this type can be displayed in 2D views, sheets, and schedules.
Remarks:
ImageType elements are created when importing images for placement in a 2D view via
Document.Import(string, ImageImportOptions, View, out Element).
ImageType elements can also be created without corresponding instances (for example, to add them to cells in schedules).
Since:
2015